[
  {
    "id": 1,
    "content": "How do you handle situations where you are bored when learning?",
    "difficulty": "Easy",
    "read": false
  },
  {
    "id": 2,
    "content": "How has technology impacted the way you approach lifelong learning?",
    "difficulty": "Easy",
    "read": false
  },
  {
    "id": 3,
    "content": "Share an experience where learning something new significantly changed your perspective.",
    "difficulty": "Easy",
    "read": false
  },
  {
    "id": 4,
    "content": "How do you balance work, family, and personal growth in your pursuit of lifelong learning?",
    "difficulty": "Easy",
    "read": false
  },
  {
    "id": 5,
    "content": "What advice would you give to someone who feels they are too old or busy to continue learning?",
    "difficulty": "Easy",
    "read": false
  },
  {
    "id": 6,
    "content": "What role do you think curiosity plays in lifelong learning?",
    "difficulty": "Medium",
    "read": false
  },
  {
    "id": 7,
    "content": "Can you think a time when a failure or setback became a valuable learning experience?",
    "difficulty": "Medium",
    "read": false
  },
  {
    "id": 8,
    "content": "How has lifelong learning impacted your career or personal life?",
    "difficulty": "Medium",
    "read": false
  },
  {
    "id": 9,
    "content": "What are the risks or downsides of not engaging in lifelong learning in today's fast-paced world?",
    "difficulty": "Medium",
    "read": false
  },
  {
    "id": 10,
    "content": "Describe a mentor or role model who has significantly influenced your approach to lifelong learning. What did you learn from them?",
    "difficulty": "Medium",
    "read": false
  },
  {
    "id": 11,
    "content": "How do you stay motivated to learn new things, especially when faced with challenging or unfamiliar topics?",
    "difficulty": "Medium",
    "read": false
  },
  {
    "id": 12,
    "content": "How can organizations and communities support and encourage lifelong learning?",
    "difficulty": "Hard",
    "read": false
  },
  {
    "id": 13,
    "content": "What's one skill you wish you had learned earlier in life? Why?",
    "difficulty": "Hard",
    "read": false
  },
  {
    "id": 14,
    "content": "How can you integrate lifelong learning into your daily routine without feeling overwhelmed?",
    "difficulty": "Hard",
    "read": false
  },
  {
    "id": 15,
    "content": "In what ways can lifelong learning contribute to a more fulfilling and purposeful life?",
    "difficulty": "Hard",
    "read": false
  }
]

